// 题目描述
// 有这样一道智力题：“某商店规定：
// 三个空汽水瓶可以换一瓶汽水。小张手上有十个空汽水瓶，她最多可以换多少瓶汽水喝？
// ”答案是5瓶，方法如下：先用9个空瓶子换3瓶汽水，喝掉3瓶满的，喝完以后4个空瓶子，用3个再换一瓶，
// 喝掉这瓶满的，这时候剩2个空瓶子。然后你让老板先借给你一瓶汽水，喝掉这瓶满的，
// 喝完以后用3个空瓶子换一瓶满的还给老板。如果小张手上有n个空汽水瓶，最多可以换多少瓶汽水喝？
// 输入格式
// 输入文件最多包含10组测试数据，每个数据占一行，
// 仅包含一个正整数n（1<=n<=100），表示小张手上的空汽水瓶数。n=0表示输入结束，你的程序不应当处理这一行。

// 输出格式
// 对于每组测试数据，输出一行，表示最多可以喝的汽水瓶数。如果一瓶也喝不到，输出0。
// 样例输入
// 3
// 10
// 81
// 0
// 样例输出
// 1
// 5
// 40
//数据准备：需要有一个变量记录最多可以喝的瓶数
//第一次可以喝的数量是n / 3，空瓶数是n % 3 + n / 3
//第二次可以喝的数是（n % 3 + n / 3） / 3
//if(n == 2) 可以喝的数量加1
//循环终止条件是while(n != 0)

//输入：整形变量n   （持有的空瓶数）
//输出：最多可以喝的数
//边界：1 <= n <= 100

//定义n和count = 0
//重复键盘录入n
//while(n != 0)
//count += n / 3
//n = count + n % 3
//if(n == 2)
//count++
//循环结束
//printf("%d\n",count);

#include <stdio.h>

int main()
{
    int n;
    int count;
    int drinks;

    while(1)
    {
        scanf("%d",&n);

        if(n == 0)
        {
            break;
        }
        count = 0;
        while(n >= 3)
        {
            drinks = n / 3;
            count += drinks;
            n = drinks + n % 3;
        }
        
        if(n == 2)
        {
            count++;
        }

        printf("%d\n",count);
    }
    return 0;
}