// 题目描述
// 你的弟弟刚做完了“100以内数的加减法”这部分的作业，请你帮他检查一下。
// 每道题目（包括弟弟的答案）的格式为a+b=c或者a-b=c，
// 其中a和b是作业中给出的，均为不超过100的非负整数；c是弟弟算出的答案，可能是不超过200的非负整数，
// 也可能是单个字符"?"，表示他不会算。
// 输入格式
// 输入文件包含不超过100行，以文件结束符结尾。每行包含一道题目，格式保证符合上述规定，且不包含任何空白字符。
// 输入的所有整数均不含前导0。

// 输出格式
// 输出仅一行，包含一个非负整数，即弟弟答对的题目数量。

// 样例输入
// 1+2=3
// 3-1=5
// 6+7=?
// 99-0=99
// 样例输出
// 2

//我认为，算式分为三种，第一种正确算出，第二种错误算出，第三种“？”
//输出弟弟答对的数量，就需要有总计数count

//输入：一个算式，类似21行的想法
//输出：答对的数量
//边界：总算式数小于等于100，a和b小于等于100大于等于0，c于等于200大于等于0

//需要在外围套一个循环，以便重复输入
//因为输入的是式子而非值，所以键盘录入的应该是字符串
//这时候就需要判断字符串中的算式是否正确        但我想到似乎没有方法可以直接判断字符串中算式的正确
//然后count++
// 直到所有算式都判断完毕
//在循环外printf("%d\n",count)

#include <stdio.h>

int main()
{
    int a,b;
    char op;
    char answer[4];
    int correctresult;
    int studentresult;
    int count = 0;

    while(scanf("%d%c%d=%3s",&a,&op,&b,answer)== 4)
    {
        //现在算式的各值已经有了数据
        if(op == '+')
        {
            correctresult = a + b;
        }
        else
        {
            correctresult = a - b; 
        }

        if(answer[0] == '?')
        {
            continue;
        }

        sscanf(answer, "%d", &studentresult);

        if(correctresult == studentresult)
        {
            count++;
        }
    }

    printf("%d\n",count);

    return 0;
}