// 题目描述
// 定理：把一个至少两位的正整数的个位数字去掉，再从余下的数中减去个位数的5倍。当且仅当差是17的倍数时，原数也是17的倍数 。

// 例如，34是17的倍数，因为3-20=-17是17的倍数；
// 201不是17的倍数，因为20-5=15不是17的倍数。输入一个正整数n，你的任务是判断它是否是17的倍数。

// 输入格式
// 输入文件最多包含10组测试数据，每个数据占一行，
// 仅包含一个正整数n（1<=n<=10^100），表示待判断的正整数。n=0表示输入结束，你的程序不应当处理这一行。

// 输出格式
// 对于每组测试数据，输出一行，表示相应的n是否是17的倍数。1表示是，0表示否。

// 样例输入
// 34
// 201
// 2098765413
// 1717171717171717171717171717171717171717171717171718
// 0
// 样例输出
// 1
// 0
// 1
// 0

//输入：最多十组的正整数n
//输出：对应测试数据是否是17的倍数，每组数据一行
//边界：1<=n<=10^100    最多十组数据
//把个位数去除，个位数*5，剩下的数-个位数*5。if能够整除17，就是17的倍数
//需要准备的数据是正整数n，个位数int one,
//while(scanf("%d",&n)!=EOF)
//one = n
//后来查询了解到因为n的最大值太大超出了long long的范围，所以需要用到字符串来储存n。（我原来考虑到n的范围较大所以打算用long long类型）
//那么就定义字符数组char n[102]
//int len = strlen(n)
//int last_dight = n[len - 1] - '0';    但我不太理解是怎么运行的
//这里有了个位数的值

#include <stdio.h>

int main()
{
    char n[102];
    int digit;
    int remainder;

    while(scanf("%101s",n) == 1)
    {
        if(n[0] == '0' && n[1] == '\0')
        {
            break;
        }

        remainder = 0;

        for(int i = 0;n[i] != '\0';i++)
        {
            digit = n[i] - '0';
            remainder = (remainder * 10 + digit) % 17;
        }

        if(remainder == 0)
        {
            printf("1\n");
        }
        else
        {
            printf("0\n");
        }
    }

    return 0;
}