// 题目描述
// 打印出所有"水仙花数"，所谓"水仙花数"是指一个三位数，其各位数字立方和等于该本身。
//  例如：153是一个水仙花数，因为153=1^3+5^3+3^3。 
// 输入格式
// 无
// 输出格式
// 输出每一个水仙花数，一个数占一行
// 样例输入
// 无
// 样例输出
// 无

//无输入
//输出每一个水仙花数，独立一行
//边界（100 <= x <= 999）
//循环从100开始，到99结束
//获得百位上的数，需要除100 。获得十位上的数，余100然后除10。各位上的数就余100再余10
// 然后各自的三次方相加，如果等于这个数，就是水仙花数
//所以还需要有三个数分别记录三个位置的数，hundred,ten,one
//代码运行：
//定义一个整型x，for（int i = 100；i <= 999;i++）->hundred = i /100
//ten = i % 100 /10->one = ten % 10
//if(i = pow(hundred,3) + pow(ten,3) + pow(one,3))
//printf("%d\n",i);

#include <stdio.h>
#include <math.h>

int main()
{
    int hundred,ten,one;

    for(int i = 100;i <= 999;i++)
    {
        hundred = i /100;
        ten = i % 100 /10;
        one = i % 10;

        if(i == pow(hundred,3) + pow(ten,3) + pow(one,3))
        {
            printf("%d\n",i);
        }
    }

    return 0;
}
//153/100 = 1
//153%100 = 53; 53/10 = 5;
//53%10 = 3
// 1*1*1 = 1   5*5*5 = 125    3*3*3 = 27
// 1+125+27 = 153