// 题目描述
// 一个数如果恰好等于不包含它本身所有因子之和，这个数就称为"完数"。
//  例如，6的因子为1、2、3，而6=1+2+3，因此6是"完数"。 编程序找出N之内的所有完数，并按下面格式输出其因子

// 输入格式
// N

// 输出格式
// ? its factors are ? ? ?

// 样例输入
// 1000
// 样例输出
// 6 its factors are 1 2 3 
// 28 its factors are 1 2 4 7 14 
// 496 its factors are 1 2 4 8 16 31 62 124 248 

//输入：一个整数（作为范围）
//输出：完数以及其所有因子（不包含本身），每个因子用空格隔开
//思路：从1开始，6%1==0，6%2==0，那就这样一直计算，只要相余为0就可以了，也不需要考虑2*3 = 6中的3是否是完数
//因为随着循环次数的增加，会轮到6%3判断能否整除
//这样不断累加，循环条件是for(int j = 1;j < 6;j++)这样还可以避免6%5这样本身除以本身的结果
//就可以得到等于不包含它本身所有因子之和
//借此判断该数是否是完数
//如果是完数，就按照格式输出
//还需要一个数组去记录每一个完数的因子（不包括本身）

//由于题目要求找出N内的所有完数，就要有一个循环for(int i = 2;i <= N;i++)写在判断是否是完数的循环之外

//需要准备的数据：N，count，number[100]
#include <stdio.h>

int main()
{
    int N;
    int sum = 0;

    scanf("%d",&N);

    for(int i = 2;i <= N;i++)
    {
        sum = 0;

        for(int j = 1;j < i;j++)
        {
            if(i % j == 0)
            {
                sum +=j;
            }
        }
        if(sum == i) //这个数就是完数
        {
            printf("%d its factors are",i);
            for(int j = 1;j < i;j++)
            {
                if(i % j == 0)
                {
                    printf(" %d",j);
                }
            }
            printf("\n");
        }
    }
    return 0;
}